const translations = {
    ua: {
        nav: {
            home: "Головна",
            game1: "Словотвір",
            game2: "Картки",
            practice: "Практика",
            clues: 'Ключі',
            classes: "Навчання",
        },

        footer: {
            address: "Адреса: Одеса, вул. М.Жукова, 25",
        },

        intro: {
            greet: "Давайте познайомимося",
            "start-text1": "Мене звуть Катерина, я репетитор з англійської мови та математики в Одесі. Я працюю з учнями від 10 років і старше. Готую до іспитів всіх рівнів: від шкільних тестів до IELTS та вступних іспитів до закордонних університетів. У мене понад вісім років досвіду викладання, і серед моїх випускників є учні всіх віків і рівнів. Я також із задоволенням допоможу вам з вашим запитом — будь ласка, надішліть запит, використовуючи",
            "link-form": "посилання",
            "start-text2": "або напишіть мені в",
            "start-text3": ". Якщо ми вже знайомі, буду рада отримати",
            "link-review": "ваш відгук",
            "start-text4": ": задоволені учні — моя головна мотивація.",
            about: "На цій сторінці Ваші діти зможуть пограти у розроблені мною навчальні ігри з англійської мови. Підказки та відповідіможна знайти на сторінці з ключами. Розважайтеся!"
        },

        games: {
            game1: 'Гра "Словотвір"',
            game2: 'Гра "Картки"',
            practice: 'Практичні завдання',
            clues: 'Ключі до завдань',
            check: "Перевірити",
            choice: "Обери варіант",
            reset: "Наново"
        },

        game1: {
            rule1: "Склади слово із букв",
            rule2: "Обери правильний переклад",
            rule3: "Обери правильну букву",            
            horse: "Кінь",
            elephant: "Слон",
            bed: "Кровать",
            frigde: "Холодильник",
            fish: "Риба",
            fox: "Лисиця",
            cherry: "Вишня",
            table: "Стол",
            chair: "Стілець"
        },

        game2: {
            rule1: "Обери правильне слово",
            rule2: "Перетягни слова до картинок",
            rule3: "Заповни кросворд назвами картинок",
        },

        practice:{
            task: "Завдання для підтвердження рівня А1 (Beginner) англійської мови",
            rule: "Обери правильну відповідь",
            success: "Вітаю! Всі відповіді правильні! 🎉 ({correctCount}/{totalTasks})",
            completeMessage: "Будь ласка, дай відповідь на всі завдання! ({answeredCount}/{totalTasks})",
            practiceResult: "Результат: {correctCount} з {totalTasks} ({percentage}%)\nПродовжуй практикуватись!"
        },

        messages: {
            success: "Вітаю! Усе правильно! 🎉",
            error: "Є помилки. Спробуй ще раз!",
            alert: "Обери варіант!",
            matchword: "Перетягни сюди",
            matchgame: " з 6. Спробуй ще раз!"
        },

        clues: {
            cards: 'Підказки до ігор "Картки"',
            words: 'Відповіді до ігор "Слова"',
            game1: "Відповіді до першої гри",
            game2: "Відповіді до другої гри",
            game3: "Відповіді до третьої гри"
        }
    },

    ru: {
        nav: {
            home: "Главная",
            game1: "Слова",
            game2: "Карточки",
            practice: "Практика",
            clues: 'Ключи',
            classes: "Обучение",
        },

        footer: {
            address: "Адресс: Одесса, ул. М.Жукова, 25",
        },

        intro: {
            greet: "Давайте познакомимся",
            "start-text1": "Меня зовут Екатерина, я репетитор по английскому языку и математике в Одессе. Я работаю с учениками от 10 лет и старше. Готовлю к экзаменам всех уровней: от школьных тестов до IELTS и вступительных экзаменов в зарубежные университеты. У меня более восьми лет опыта преподавания, и среди моих выпускников есть ученики всех возрастов и уровней. Я также с удовольствием помогу вам с вашим запросом — пожалуйста, отправьте запрос, используя",
            "link-form": "ссылку",
            "start-text2": "или напишите мне в",
            "start-text3": ". Если мы уже знакомы, буду рада получить",
            "link-review": "ваш отзыв",
            "start-text4": ": довольные ученики — моя главная мотивация.",
            about: "На этой странице ваши дети смогут поиграть в разработанные мною обучающие игры по английскому языку. Подсказки и ответы можно найти на странице с ключами. Развлекайтесь!"
        },

        games: {
            game1: 'Игра "Слова"',
            game2: 'Игра "Карточки"',
            practice: 'Практические задания',
            clues: 'Ключи к заданиям',
            check: "Проверить",
            choice: "Выбери вариант",
            reset: "Заново"
        },
        
        game1: {
            rule1: "Сложи слово из букв",
            rule2: "Выбери правильный перевод",
            rule3: "Выбери правильную букву",
            horse: "Конь",
            elephant: "Слон",
            bed: "Кровать",
            frigde: "Холодильник",
            fish: "Рыба",
            fox: "Лиса",
            cherry: "Вишня",
            table: "Стол",
            chair: "Стул"
        },

        game2: {
            rule1: "Выбери правильное слово",
            rule2: "Перетяни слова к картинкам",
            rule3: "Заполни кроссворд названиями картинок"
        },

        practice:{
            task: "Задание для подтверждения уровня А1 (Beginner) фнглийского языка",
            rule: "Выбери правильный ответ",
            success: "Поздравляю! Все ответы правильные! 🎉 ({correctCount}/{totalTasks})",
            completeMessage: "Пожалуйста, дай ответ на все задания! ({answeredCount}/{totalTasks})",
            practiceResult: "Результат: {correctCount} из {totalTasks} ({percentage}%)\nПродолжай практиковаться!"
        },

        messages: {
            success: "Поздравляю! Все правильно! 🎉",
            error: "Есть ошибки. Попробуй ещё раз!",
            alert: "Выбери вариант!",
            matchword: "Перетяни сюда",
            matchgame: " из 6. Попробуй еще раз!"
        },

        clues: {
            cards: 'Подсказки к играм "Карточки"',
            words: 'Ответы к играм "Слова"',
            game1: "Ответы к первой игре",
            game2: "Ответы ко второй игре",
            game3: "Ответы к третьей игре"
        }
    },

}